In [61]:
import pandas as pd

In [62]:
df=pd.read_csv('Messy_Employment_India_Dataset.csv')
df.head()

,Status,Age Group,Education,Industry,Location,AI Risk,Years of Experience,Monthly Salary (INR),Date Recorded
0,EMPLOYED,25_34,high school,Technology,Urban,NaN,NaN,40700.0,1/1/2023
1,EMPLOYED,18-24,Diploma,Fintech,rural,moderate,NaN,17500.0,1/2/2023
2,EMPLOYED,25_34,High School,Retail,Delhi,Low,16.0,77600.0,1/3/2023
3,UNEMPLOYED,18-24,Masters,Retail,Urban,Low,30.0,100200.0,1/4/2023
4,NaN,45-54,Diploma,Fintech,Hyderabad,low,9.0,19500.0,1/5/2023

In [63]:
df.describe()

       Years of Experience  Monthly Salary (INR)
count           980.000000           1613.000000
mean             15.244898          76886.360818
std               9.103941          41628.008054
min               0.000000           5100.000000
25%               7.000000          40700.000000
50%              16.000000          77200.000000
75%              23.000000         112400.000000
max              30.000000         149900.000000

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Status                1732 non-null   object
 1   Age Group             1768 non-null   object
 2   Education             1804 non-null   object
 3   Industry              1799 non-null   object
 4   Location              1787 non-null   object
 5   AI Risk               1716 non-null   object
 6   Years of Experience   980 non-null    float64
 7   Monthly Salary (INR)  1613 non-null   float64
 8   Date Recorded         2000 non-null   object
dtypes: float64(2), object(7)
memory usage: 140.8+ KB

In [65]:
df.shape

(2000, 9)

In [66]:
df.columns

Index(['Status', 'Age Group', 'Education', 'Industry', 'Location', 'AI Risk',
       'Years of Experience', 'Monthly Salary (INR)', 'Date Recorded'],
      dtype='object')

In [67]:
df.isna().sum()

Status                   268
Age Group                232
Education                196
Industry                 201
Location                 213
AI Risk                  284
Years of Experience     1020
Monthly Salary (INR)     387
Date Recorded              0
dtype: int64

In [68]:
df.dropna(how='all', inplace=True)

In [69]:
df.duplicated().sum()

np.int64(0)

In [70]:
# Data Cleaning Status

df['Status'] = df['Status'].str.strip().str.lower()
df['Status']=df['Status'].replace({
    'employed': 'Employed',
    'unemployed': 'Unemployed'
})

In [71]:
# Data cleaning Age Group
df['Age Group'].str.strip()
df['Age Group']=df['Age Group'].str.replace(' ','')
df['Age Group']=df['Age Group'].str.replace('_','-')
df['Age Group']=df['Age Group'].str.replace('to','-')

In [72]:
# Data Cleaning Education
df['Education']=df['Education'].str.lower().str.strip()
df['Education']=df['Education'].replace({
    'high school':'High school',
    'master':"Master's",
    "masters":"Master's",
    'phd':'PhD',
    'ph.d':'PhD',
    'bachelors':"Bachelor's",
    "bachelor's":"Bachelor's",
    'diploma':'Diploma'
})
df['Education'].unique()

array(['High school', 'Diploma', "Master's", 'PhD', "Bachelor's", nan],
      dtype=object)

In [73]:
# Data Cleaning Industry

df['Industry']=df['Industry'].str.strip()
df['Industry']=df['Industry'].replace({
    'Tech':'Technology',
    'Fintech':'Finance',
    'Health':'Healthcare'
})
df['Industry'].unique()

array(['Technology', 'Finance', 'Retail', nan, 'Healthcare', 'Education'],
      dtype=object)

In [74]:
# Data Cleaning Location
df['Location']=df['Location'].str.strip().str.lower()
df['Location']=df['Location'].replace({
    'urban':'Urban',
    'rural':'Rural',
    'delhi':"Delhi",
    'hyderabad':'Hyderabad',
    'bangalore':'Bangalore',
    'mumbai':'Mumbai',
    'suburban':'Suburban'
})
df['Location'].unique()

array(['Urban', 'Rural', 'Delhi', 'Hyderabad', 'Bangalore', 'Mumbai', nan,
       'Suburban'], dtype=object)

In [75]:
# Data Cleaning AI Risk
df['AI Risk']=df['AI Risk'].str.strip().str.lower().str.capitalize()
df['AI Risk']=df['AI Risk'].replace({
    'Moderate':'Medium'
})
df['AI Risk'].unique()

array([nan, 'Medium', 'Low', 'High'], dtype=object)

In [76]:
# Data Cleaning Years of Experience
df['Years of Experience']

0        NaN
1        NaN
2       16.0
3       30.0
4        9.0
        ...
1995     NaN
1996    22.0
1997     NaN
1998    22.0
1999     NaN
Name: Years of Experience, Length: 2000, dtype: float64

In [77]:
# Data Cleaning Monthly Salary 
df['Monthly Salary (INR)']

0        40700.0
1        17500.0
2        77600.0
3       100200.0
4        19500.0
          ...
1995    113000.0
1996    102200.0
1997     31600.0
1998     92500.0
1999     43300.0
Name: Monthly Salary (INR), Length: 2000, dtype: float64

In [78]:
# Data Cleaning Date Recorded
df['Date Recorded']=pd.to_datetime(df['Date Recorded'], format='%m/%d/%Y')
df['Date Recorded']

0      2023-01-01
1      2023-01-02
2      2023-01-03
3      2023-01-04
4      2023-01-05
          ...
1995   2028-06-18
1996   2028-06-19
1997   2028-06-20
1998   2028-06-21
1999   2028-06-22
Name: Date Recorded, Length: 2000, dtype: datetime64[ns]

In [79]:
# Categorical columns - fill with mode
for col in ['Status', 'Age Group', 'Education', 'Industry', 'Location', 'AI Risk']:
    df[col].fillna(df[col].mode()[0], inplace=True)

# Years of Experience - grouped median by Age Group
df['Years of Experience'] = df.groupby('Age Group')['Years of Experience']\
                              .transform(lambda x: x.fillna(x.median()))

# Monthly Salary - grouped median by Industry and Status
df['Monthly Salary (INR)'] = df.groupby(['Industry', 'Status'])['Monthly Salary (INR)']\
                               .transform(lambda x: x.fillna(x.median()))

/var/folders/j1/_tnwx8d56wx5sj4gpt88m0z80000gn/T/ipykernel_63123/2081856836.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mode()[0], inplace=True)

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Status                2000 non-null   object
 1   Age Group             2000 non-null   object
 2   Education             2000 non-null   object
 3   Industry              2000 non-null   object
 4   Location              2000 non-null   object
 5   AI Risk               2000 non-null   object
 6   Years of Experience   2000 non-null   float64
 7   Monthly Salary (INR)  2000 non-null   float64
 8   Date Recorded         2000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(6)
memory usage: 140.8+ KB

In [81]:
df.to_csv("cleaned_data.csv",index=False)